/******************************************************************************
 * mt_gpio_debug.c - MTKLinux GPIO Device Driver
 * 
 * Copyright 2008-2009 MediaTek Co.,Ltd.
 * 
 * DESCRIPTION:
 *     This file provid the other drivers GPIO debug functions
 *
 ******************************************************************************/

#include <linux/slab.h>
#ifndef CONFIG_OF
#include <mach/mt_reg_base.h>
#endif
#include <mach/mt_gpio.h>
#include <mach/mt_gpio_core.h>

/*----------------------------------------------------------------------------*/
typedef struct {        /*FIXME: check GPIO spec*/
    unsigned int no     : 16;
    unsigned int mode   : 3;    
    unsigned int pullsel: 1;
    unsigned int din    : 1;
    unsigned int dout   : 1;
    unsigned int pullen : 1;
    unsigned int dir    : 1;
/*    unsigned int dinv   : 1;*/
    unsigned int ies    : 1;
    unsigned int _align : 7; 
} GPIO_CFG; 

//#define MAX_GPIO_REG_BITS      16
//#define MAX_GPIO_MODE_PER_REG  5
//#define GPIO_MODE_BITS         3 
/******************************************************************************
*clock out module
*******************************************************************************/
int mt_set_clock_output(unsigned long num, unsigned long src, unsigned long div)
{
	GPIOERR("GPIO CLKM module not be implement any more!\n");
    return RSUCCESS;
}

int mt_get_clock_output(unsigned long num, unsigned long * src, unsigned long *div)
{
	GPIOERR("GPIO CLKM module not be implement any more!\n");
	return RSUCCESS;
}
/*****************************************************************************/
/* sysfs operation                                                           */
/*****************************************************************************/
void mt_gpio_self_test(void)
{
    int i, val;
    for (i = 0; i < MT_GPIO_EXT_MAX; i++)
    {
        s32 res,old;
        GPIOMSG("GPIO-%3d test\n", i);
        /*direction test*/
        old = mt_get_gpio_dir_base(i);
        if (old == 0 || old == 1) {
            GPIOLOG(" dir old = %d\n", old);
        } else {
            GPIOERR(" test dir fail: %d\n", old);
            break;
        }
        if ((res = mt_set_gpio_dir_base(i, GPIO_DIR_OUT)) != RSUCCESS) {
            GPIOERR(" set dir out fail: %d\n", res);
            break;
        } else if ((res = mt_get_gpio_dir_base(i)) != GPIO_DIR_OUT) {
            GPIOERR(" get dir out fail: %d\n", res);
            break;
        } else {
            /*output test*/
            s32 out = mt_get_gpio_out_base(i);
            if (out != 0 && out != 1) {
                GPIOERR(" get out fail = %d\n", old);
                break;
            } 
            for (val = 0; val < GPIO_OUT_MAX; val++) {
                if ((res = mt_set_gpio_out_base(i,0)) != RSUCCESS) {
                    GPIOERR(" set out[%d] fail: %d\n", val, res);
                    break;
                } else if ((res = mt_get_gpio_out_base(i)) != 0) {
                    GPIOERR(" get out[%d] fail: %d\n", val, res);
                    break;
                }
            }
            if ((res = mt_set_gpio_out_base(i,out)) != RSUCCESS)
            {
                GPIOERR(" restore out fail: %d\n", res);
                break;
            }
        }
            
        if ((res = mt_set_gpio_dir_base(i, GPIO_DIR_IN)) != RSUCCESS) {
            GPIOERR(" set dir in fail: %d\n", res);
            break;
        } else if ((res = mt_get_gpio_dir_base(i)) != GPIO_DIR_IN) {
            GPIOERR(" get dir in fail: %d\n", res);
            break;
        } else {
            GPIOLOG(" input data = %d\n", res);
        }
        
        if ((res = mt_set_gpio_dir_base(i, old)) != RSUCCESS) {
            GPIOERR(" restore dir fail: %d\n", res);
            break;
        }
        for (val = 0; val < GPIO_PULL_EN_MAX; val++) {
            if ((res = mt_set_gpio_pull_enable_base(i,val)) != RSUCCESS) {
                GPIOERR(" set pullen[%d] fail: %d\n", val, res);
                break;
            } else if ((res = mt_get_gpio_pull_enable_base(i)) != val) {
                GPIOERR(" get pullen[%d] fail: %d\n", val, res);
                break;
            }
        }        
        if ((res = mt_set_gpio_pull_enable_base(i, old)) != RSUCCESS) {
            GPIOERR(" restore pullen fail: %d\n", res);
            break;
        }

        /*pull select test*/
        old = mt_get_gpio_pull_select_base(i);
        if (old == 0 || old == 1)
            GPIOLOG(" pullsel old = %d\n", old);
        else {
            GPIOERR(" pullsel fail: %d\n", old);
            break;
        }
        for (val = 0; val < GPIO_PULL_MAX; val++) {
            if ((res = mt_set_gpio_pull_select_base(i,val)) != RSUCCESS) {
                GPIOERR(" set pullsel[%d] fail: %d\n", val, res);
                break;
            } else if ((res = mt_get_gpio_pull_select_base(i)) != val) {
                GPIOERR(" get pullsel[%d] fail: %d\n", val, res);
                break;
            }
        } 
        if ((res = mt_set_gpio_pull_select_base(i, old)) != RSUCCESS)
        {
            GPIOERR(" restore pullsel fail: %d\n", res);
            break;
        }     

        /*data inversion*/
        old = mt_get_gpio_inversion_base(i);
        if (old == 0 || old == 1)
            GPIOLOG(" inv old = %d\n", old);
        else {
            GPIOERR(" inv fail: %d\n", old);
            break;
        }
        for (val = 0; val < GPIO_DATA_INV_MAX; val++) {
            if ((res = mt_set_gpio_inversion_base(i,val)) != RSUCCESS) {
                GPIOERR(" set inv[%d] fail: %d\n", val, res);
                break;
            } else if ((res = mt_get_gpio_inversion_base(i)) != val) {
                GPIOERR(" get inv[%d] fail: %d\n", val, res);
                break;
            }
        } 
        if ((res = mt_set_gpio_inversion_base(i, old)) != RSUCCESS) {
            GPIOERR(" restore inv fail: %d\n", res);
            break;
        }     

        /*mode control*/
//		if((i<=GPIOEXT6) || (i >= GPIOEXT9)){
        old = mt_get_gpio_mode_base(i);
        if ((old >= GPIO_MODE_00) && (val < GPIO_MODE_MAX))
        {
            GPIOLOG(" mode old = %d\n", old);
        }
        else
        {
            GPIOERR(" get mode fail: %d\n", old);
            break;
        }
        for (val = 0; val < GPIO_MODE_MAX; val++) {
            if ((res = mt_set_gpio_mode_base(i, val)) != RSUCCESS) {
                GPIOERR("set mode[%d] fail: %d\n", val, res);
                break;
            } else if ((res = mt_get_gpio_mode_base(i)) != val) {
                GPIOERR("get mode[%d] fail: %d\n", val, res);
                break;
            }            
        }        
        if ((res = mt_set_gpio_mode_base(i,old)) != RSUCCESS) {
            GPIOERR(" restore mode fail: %d\n", res);
            break;
        }   
//		}    
    }
    GPIOLOG("GPIO test done\n");
}
/*----------------------------------------------------------------------------
void mt_gpio_load_ext(GPIOEXT_REGS *regs) 
{
    GPIOEXT_REGS *pReg = (GPIOEXT_REGS*)(GPIOEXT_BASE);
    int idx;
    
    if (!regs)
        GPIOERR("%s: null pointer\n", __func__);
    memset(regs, 0x00, sizeof(*regs));
    for (idx = 0; idx < sizeof(pReg->dir)/sizeof(pReg->dir[0]); idx++)
        regs->dir[idx].val = GPIOEXT_RD(&pReg->dir[idx]);
    for (idx = 0; idx < sizeof(pReg->pullen)/sizeof(pReg->pullen[0]); idx++)
        regs->pullen[idx].val = GPIOEXT_RD(&pReg->pullen[idx]);
    for (idx = 0; idx < sizeof(pReg->pullsel)/sizeof(pReg->pullsel[0]); idx++)
        regs->pullsel[idx].val =GPIOEXT_RD(&pReg->pullsel[idx]);
    for (idx = 0; idx < sizeof(pReg->dinv)/sizeof(pReg->dinv[0]); idx++)
        regs->dinv[idx].val =GPIOEXT_RD(&pReg->dinv[idx]);
    for (idx = 0; idx < sizeof(pReg->dout)/sizeof(pReg->dout[0]); idx++)
        regs->dout[idx].val = GPIOEXT_RD(&pReg->dout[idx]);
    for (idx = 0; idx < sizeof(pReg->mode)/sizeof(pReg->mode[0]); idx++)
        regs->mode[idx].val = GPIOEXT_RD(&pReg->mode[idx]);
    for (idx = 0; idx < sizeof(pReg->din)/sizeof(pReg->din[0]); idx++)
        regs->din[idx].val = GPIOEXT_RD(&pReg->din[idx]);
}
EXPORT_SYMBOL(mt_gpio_load_ext);
----------------------------------------------------------------------------*/
void mt_gpio_load_base(GPIO_REGS *regs) 
{
    GPIO_REGS *pReg = (GPIO_REGS*)(GPIO_BASE_1);
    int idx;
    
    if (!regs)
        GPIOERR("%s: null pointer\n", __func__);
    memset(regs, 0x00, sizeof(*regs));
    for (idx = 0; idx < sizeof(pReg->dir)/sizeof(pReg->dir[0]); idx++)
        regs->dir[idx].val = __raw_readl(&pReg->dir[idx]);
    for (idx = 0; idx < sizeof(pReg->ies)/sizeof(pReg->ies[0]); idx++)
        regs->ies[idx].val = __raw_readl(&pReg->ies[idx]);
    for (idx = 0; idx < sizeof(pReg->pullen)/sizeof(pReg->pullen[0]); idx++)
        regs->pullen[idx].val = __raw_readl(&pReg->pullen[idx]);
    for (idx = 0; idx < sizeof(pReg->pullsel)/sizeof(pReg->pullsel[0]); idx++)
        regs->pullsel[idx].val =__raw_readl(&pReg->pullsel[idx]);
/*    for (idx = 0; idx < sizeof(pReg->dinv)/sizeof(pReg->dinv[0]); idx++)
        regs->dinv[idx].val =__raw_readl(&pReg->dinv[idx]);*/
    for (idx = 0; idx < sizeof(pReg->dout)/sizeof(pReg->dout[0]); idx++)
        regs->dout[idx].val = __raw_readl(&pReg->dout[idx]);
    for (idx = 0; idx < sizeof(pReg->mode)/sizeof(pReg->mode[0]); idx++)
        regs->mode[idx].val = __raw_readl(&pReg->mode[idx]);
    for (idx = 0; idx < sizeof(pReg->din)/sizeof(pReg->din[0]); idx++)
        regs->din[idx].val = __raw_readl(&pReg->din[idx]);
}
//EXPORT_SYMBOL(mt_gpio_load_base);
/*----------------------------------------------------------------------------
void mt_gpio_dump_ext( GPIOEXT_REGS *regs) 
{
    GPIOEXT_REGS *cur = NULL ;    
    int idx;
    GPIOMSG("%s\n", __func__);
	//if arg is null, load & dump; otherwise, dump only
	if (regs == NULL) { 
		cur = kzalloc(sizeof(*cur), GFP_KERNEL);    
		if (cur == NULL) {
			GPIOERR("GPIO extend null pointer\n");
			return;
		}
        regs = cur;
		mt_gpio_load_ext(cur);
        GPIOMSG("dump current: %p\n", regs);
    } else {
        GPIOMSG("dump %p ...\n", regs);    
    }
    GPIOMSG("\nGPIO extend-------------------------------------------------------------------\n");    
    GPIOMSG("---# dir #-----------------------------------------------------------------\n");
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->dir[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->dir)/sizeof(regs->dir[0]); idx++) {
        GPIOMSG("0x%04X ", regs->dir[idx].val);
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    //GPIOMSG("\n---# ies #-----------------------------------------------------------------\n");
    //GPIOMSG("Offset 0x%04X\n",(void *)(&regs->ies[0]);
    //for (idx = 0; idx < sizeof(regs->ies)/sizeof(regs->ies[0]); idx++) {
    //    GPIOMSG("0x%04X ", regs->ies[idx].val);
    //    if (7 == (idx % 8)) GPIOMSG("\n");
    //}
    GPIOMSG("\n---# pullen #--------------------------------------------------------------\n");        
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->pullen[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->pullen)/sizeof(regs->pullen[0]); idx++) {
        GPIOMSG("0x%04X ", regs->pullen[idx].val);    
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# pullsel #-------------------------------------------------------------\n");   
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->pullsel[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->pullsel)/sizeof(regs->pullsel[0]); idx++) {
        GPIOMSG("0x%04X ", regs->pullsel[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# dinv #----------------------------------------------------------------\n");   
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->dinv[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->dinv)/sizeof(regs->dinv[0]); idx++) {
        GPIOMSG("0x%04X ", regs->dinv[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# dout #----------------------------------------------------------------\n");   
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->dout[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->dout)/sizeof(regs->dout[0]); idx++) {
        GPIOMSG("0x%04X ", regs->dout[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# din  #----------------------------------------------------------------\n");   
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->din[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->din)/sizeof(regs->din[0]); idx++) {
        GPIOMSG("0x%04X ", regs->din[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# mode #----------------------------------------------------------------\n");   
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->mode[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->mode)/sizeof(regs->mode[0]); idx++) {
        GPIOMSG("0x%04X ", regs->mode[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }    
    GPIOMSG("\n---------------------------------------------------------------------------\n");    


	if (cur != NULL) {
		kfree(cur);
	}
}
----------------------------------------------------------------------------*/
void mt_gpio_dump_base(GPIO_REGS *regs) 
{
    GPIO_REGS *cur = NULL ;    
    int idx;
    GPIOMSG("%s\n", __func__);
	if (regs == NULL) { /*if arg is null, load & dump; otherwise, dump only*/
		cur = kzalloc(sizeof(*cur), GFP_KERNEL);    
		if (cur == NULL) {
			GPIOERR("null pointer\n");
			return;
		}
        regs = cur;
        mt_gpio_load_base(regs);
        GPIOMSG("dump current: %p\n", regs);
    } else {
        GPIOMSG("dump %p ...\n", regs);    
    }

    GPIOMSG("---# dir #-----------------------------------------------------------------\n");
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%lx\n",(void *)(&regs->dir[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->dir[0])-(void *)regs);
#endif
    for (idx = 0; idx < sizeof(regs->dir)/sizeof(regs->dir[0]); idx++) {
        GPIOMSG("0x%04X ", regs->dir[idx].val);
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# ies #-----------------------------------------------------------------\n");
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%04lx\n",(void *)(&regs->ies[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->pullen[0])-(void *)regs);
#endif	
    for (idx = 0; idx < sizeof(regs->ies)/sizeof(regs->ies[0]); idx++) {
        GPIOMSG("0x%04X ", regs->ies[idx].val);
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# pullen #--------------------------------------------------------------\n");        
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%04lx\n",(void *)(&regs->pullen[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->pullen[0])-(void *)regs);
#endif
    for (idx = 0; idx < sizeof(regs->pullen)/sizeof(regs->pullen[0]); idx++) {
        GPIOMSG("0x%04X ", regs->pullen[idx].val);    
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# pullsel #-------------------------------------------------------------\n");   
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%04lx\n",(void *)(&regs->pullsel[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->pullsel[0])-(void *)regs);
#endif
    for (idx = 0; idx < sizeof(regs->pullsel)/sizeof(regs->pullsel[0]); idx++) {
        GPIOMSG("0x%04X ", regs->pullsel[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
/*    GPIOMSG("\n---# dinv #----------------------------------------------------------------\n");   
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->dinv[0])-(void *)regs);
    for (idx = 0; idx < sizeof(regs->dinv)/sizeof(regs->dinv[0]); idx++) {
        GPIOMSG("0x%04X ", regs->dinv[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }*/
    GPIOMSG("\n---# dout #----------------------------------------------------------------\n");   
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%lx\n",(void *)(&regs->dout[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->dout[0])-(void *)regs);
#endif
    for (idx = 0; idx < sizeof(regs->dout)/sizeof(regs->dout[0]); idx++) {
        GPIOMSG("0x%04X ", regs->dout[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# din  #----------------------------------------------------------------\n");   
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%lx\n",(void *)(&regs->din[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->din[0])-(void *)regs);
#endif
    for (idx = 0; idx < sizeof(regs->din)/sizeof(regs->din[0]); idx++) {
        GPIOMSG("0x%04X ", regs->din[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }
    GPIOMSG("\n---# mode #----------------------------------------------------------------\n");   
#ifdef CONFIG_64BIT
    GPIOMSG("Offset 0x%lx\n",(void *)(&regs->mode[0])-(void *)regs);
#else
    GPIOMSG("Offset 0x%04X\n",(void *)(&regs->mode[0])-(void *)regs);
#endif
    for (idx = 0; idx < sizeof(regs->mode)/sizeof(regs->mode[0]); idx++) {
        GPIOMSG("0x%04X ", regs->mode[idx].val);     
        if (7 == (idx % 8)) GPIOMSG("\n");
    }    
    GPIOMSG("\n---------------------------------------------------------------------------\n");    


	if (cur != NULL) {
		kfree(cur);
	}
}
/*----------------------------------------------------------------------------*/
typedef struct {        
    unsigned short val;        
    unsigned short _align1;
    unsigned short set;
    unsigned short _align2;
    unsigned short rst;
    unsigned short _align3[3];
} VAL_REGS_test;
/*----------------------------------------------------------------------------*/
typedef struct {
    VAL_REGS_test    dir[14];            /*0x0000 ~ 0x00DF: 224 bytes*/
    unsigned char    rsv00[32];          /*0x00E0 ~ 0x00FF: 	32 bytes*/
    VAL_REGS_test    pullen[14];         /*0x0100 ~ 0x01DF: 224 bytes*/
    unsigned char    rsv01[32];          /*0x01E0 ~ 0x01FF: 	32 bytes*/
    VAL_REGS_test    pullsel[14];        /*0x0200 ~ 0x02DF: 224 bytes*/
    unsigned char    rsv02[32];          /*0x02E0 ~ 0x02FF: 	32 bytes*/
    unsigned char    rsv03[256];         /*0x0300 ~ 0x03FF: 256 bytes*/
    VAL_REGS_test    dout[14];           /*0x0400 ~ 0x04DF: 224 bytes*/
    unsigned char    rsv04[32];          /*0x04B0 ~ 0x04FF: 	32 bytes*/
    VAL_REGS_test    din[14];            /*0x0500 ~ 0x05DF: 224 bytes*/
    unsigned char    rsv05[32];	         /*0x05E0 ~ 0x05FF: 	32 bytes*/
    VAL_REGS_test    mode[43];           /*0x0600 ~ 0x08AF: 688 bytes*/  
	unsigned char	 rsv06[80];       	 /*0x08B0 ~ 0x08FF:  80 bytes*/
	VAL_REGS_test    ies[3];             /*0x0900 ~ 0x092F: 	48 bytes*/
    VAL_REGS_test    smt[3];        	 /*0x0930 ~ 0x095F: 	48 bytes*/ 
	unsigned char    rsv07[160];	     /*0x0960 ~ 0x09FF: 160 bytes*/
	VAL_REGS_test    tdsel[8];         	 /*0x0A00 ~ 0x0A7F: 128 bytes*/ 
	VAL_REGS_test    rdsel[6];        	 /*0x0A80 ~ 0x0ADF:  96 bytes*/ 
	unsigned char	 rsv08[32];	         /*0x0AE0 ~ 0x0AFF:  32 bytes*/
	VAL_REGS_test    drv_mode[10];       /*0x0B00 ~ 0x0B9F: 160 bytes*/ 
	unsigned char	 rsv09[96];	         /*0x0BA0 ~ 0x0BFF:  96 bytes*/
	VAL_REGS_test    msdc0_ctrl0;        /*0x0C00 ~ 0x0D4F: 336 bytes*/ 
	VAL_REGS_test    msdc0_ctrl1;        
	VAL_REGS_test    msdc0_ctrl2;        
	VAL_REGS_test    msdc0_ctrl5;        
	VAL_REGS_test    msdc1_ctrl0;        
	VAL_REGS_test    msdc1_ctrl1;        
	VAL_REGS_test    msdc1_ctrl2;        
	VAL_REGS_test    msdc1_ctrl4;        
	VAL_REGS_test    msdc2_ctrl0;        
	VAL_REGS_test    msdc2_ctrl1;        
	VAL_REGS_test    msdc2_ctrl2;        
	VAL_REGS_test    msdc2_ctrl4;        
	VAL_REGS_test    msdc3_ctrl0;        
	VAL_REGS_test    msdc3_ctrl1;        
	VAL_REGS_test    msdc3_ctrl2;        
	VAL_REGS_test    msdc3_ctrl4;        
	VAL_REGS_test    msdc0_ctrl3;        
	VAL_REGS_test    msdc0_ctrl4;        
	VAL_REGS_test    msdc1_ctrl3;        
	VAL_REGS_test    msdc2_ctrl3;        
	VAL_REGS_test    msdc3_ctrl3;        
	VAL_REGS_test    dpi_ctrl[4];        /*0x0D50 ~ 0x0D8F: 	64 bytes*/
	unsigned char	 rsv10[48];	         /*0x0D90 ~ 0x0DBF:  48 bytes*/
	VAL_REGS_test    exmd_ctrl[1];       /*0x0DC0 ~ 0x0DCF: 	16 bytes*/
	VAL_REGS_test    bpi_ctrl[1];        /*0x0DD0 ~ 0x0DDF: 	16 bytes*/
	unsigned char	 rsv11[32];	         /*0x0D90 ~ 0x0DBF:  48 bytes*/
	VAL_REGS_test    kpad_ctrl[2];       /*0x0E00 ~ 0x0E1F: 	32 bytes*/
	VAL_REGS_test    sim_ctrl[4];        /*0x0E20 ~ 0x0E5F: 	64 bytes*/
} GPIO_REGS_test;

typedef union {
	GPIO_REGS_test cur_mem;
    u32 data[1024];
} TEST_NUION;

void mt_reg_test(void) 
{
	TEST_NUION *test_data = NULL;
	GPIO_REGS_test *cur_mem_data = NULL ;    
    int idx, i;

	test_data = kzalloc(sizeof(*test_data), GFP_KERNEL);  
	if (test_data == NULL) {
		GPIOERR("cur_mem null pointer.\n");
		return;
	}
#ifdef CONFIG_64BIT
	GPIOERR("test_data size=%ld.\n", sizeof(*test_data));
#else
	GPIOERR("test_data size=%d.\n", sizeof(*test_data));
#endif
	memset(test_data, 0x00, sizeof(*test_data));
	cur_mem_data = (GPIO_REGS_test *)&test_data->cur_mem;

	for (i=0; i<14; i++) {
	    cur_mem_data->dir[i].val = i;
	    cur_mem_data->pullen[i].val = i+3;
	    cur_mem_data->pullsel[i].val = i+5;
	    cur_mem_data->dout[i].val = i+16;
	    cur_mem_data->din[i].val = i+40;
	}
	for (i=0; i<43; i++) {
	    cur_mem_data->mode[i].val = i+1;
	}
	for (i=0; i<3; i++) {
